/*
    This software is Copyright by the Board of Trustees of Michigan
    State University (c) Copyright 2005.

    You may use this software under the terms of the GNU public license
    (GPL).  The terms of this license are described at:

     http://www.gnu.org/licenses/gpl.txt

     Author:
             Ron Fox
	     NSCL
	     Michigan State University
	     East Lansing, MI 48824-1321
*/


static const char* Copyright= "(C) Copyright Michigan State University 2002, All rights reserved";

#include <config.h>


#include "CAENcard.h"
#include <string>
#include <unistd.h>
#include <stdint.h>

#include <assert.h>

using namespace std;



//   Convenience function for longword swapping.
#define swaplong(n)  (((n >> 16) & 0xffff) | ((n & 0xffff) << 16))
//

#define VME_CRATE_SIZE      24	// Slots in a VME crate.

#define CAEN_REGISTERSIZE   0x2000 // Size of CAEN Register set.
#define CAEN_ROMSIZE        0x1000 // Size of CAEN ROM page.
#define CAEN_ROMOFFSET      0x8000 // Offset from base of ROM page.


// Bits we need in registers:

// Threshold memory.

#define KILLBIT  0x100		// Kill bit in threshold registers.

// Bit Set/Clear 1 register:

#define RESET       0x080
#define SELADDR     0x010

// Status register 1:


#define DREADY      0x001
#define GDREADY     0x002
#define BUSY        0x004
#define GBUSY       0x008


// Bit Set/Clear 2 register.

#define OFFLINE     0x002
#define CLEARDATA   0x004
#define KEEPOVER    0x008
#define KEEPTHRESH  0x010
#define KEEPINVALID 0x020
#define COMMONSTOP  0x400
#define STEPTHR     0x100
#define AUTOIN      0x800
#define EMPTY       0x1000
#define SLIDESUB    0x2000
#define ALLTRG      0x4000


// Control register1:

#define CTL1BLKEND   0x04
#define CTL1PROGRST  0x10
#define CTL1BERRENA  0x20
#define CTL1ALIGN64  0x40


// Multicast control register:

#define MCSTFIRST    2
#define MCSTLAST     1


// Status register 2:

#define SR2EMPTY     2		// MEB empty
#define SR2FULL      4		// MEB full.


// The structure below represents the CAEN register set:
//

struct Registers {
  uint32_t   Buffer[0x1000/sizeof(uint32_t)]; // 0x0000
  unsigned short  FirmwareRev;                 // 0x1000
  unsigned short  GeoAddress;	               // 0x1002
  unsigned short  MCSTAddress;                 // 0x1004
  unsigned short  BitSet1;	               // 0x1006
  unsigned short  BitClear1;	               // 0x1008
  unsigned short  InterruptLevel;              // 0x100a
  unsigned short  InterruptVector;             // 0x100c
  unsigned short  Status1;	               // 0x100e
  unsigned short  Control1;                    // 0x1010
  unsigned short  HighAddress;	               // 0x1012
  unsigned short  LowAddress;                  // 0x1014
  unsigned short  Reset;                       // 0x1016
  unsigned short  pad1;                        // 0x1018
  unsigned short  MCSTControl;                 // 0x101a
  unsigned short  pad2;                        // 0x101c
  unsigned short  pad3;                        // 0x101e
  unsigned short  EventTrigger;	               // 0x1020
  unsigned short  Status2;                     // 0x1022
  unsigned short  EventCounterLow;             // 0x1024
  unsigned short  EventCounterHigh;            // 0x1026
  unsigned short  IncrementEvent;              // 0x1028
  unsigned short  IncrementOffset;             // 0x102a
  unsigned short  LoadTestRegister;            // 0x102c
  unsigned short  FCLRWindow;                  // 0x102e
  unsigned short  pad4;                        // 0x1030
  unsigned short  BitSet2;                     // 0x1032
  unsigned short  BitClear2;                   // 0x1034
  unsigned short  WMemoryTestAddress;          // 0x1036
  unsigned short  MemoryTestHigh;              // 0x1038
  unsigned short  MemoryTestLow;               // 0x103a
  unsigned short  CrateSelect;                 // 0x103c
  unsigned short  TestEventWrite;              // 0x103e
  unsigned short  EventCounterReset;           // 0x1040
  unsigned short  pad5[15];                    // 0x1042-105e
  unsigned short  TDCRange;                    // 0x1060
  unsigned short  pad7;                        // 0x1062
  unsigned short  RMemoryTestAddress;          // 0x1064
  unsigned short  pad8;                        // 0x1066
  unsigned short  SWComm;                      // 0x1068
  unsigned short  SlideConstant;               // 0x106a
  unsigned short  pad10;	               // 0x106c
  unsigned short  pad11;                       // 0x106e
  unsigned short  AAD;                         // 0x1070
  unsigned short  BAD;                         // 0x1072
  unsigned short  pad9[6];                     // 0x1074-107e
  unsigned short  Thresholds[32];              // 0x1080
  
};
#define QDCIPedestal TDCRange    // same register offsets.

// The structure below represents the part of the board ROM
// we care about... it holds a few chunks of useful info about
// the board:

struct ROM {
  unsigned short  pad1[0x26/sizeof(uint16_t)];  // 0x8000 - 0x8024
  unsigned short  OUIMSB;                    // 0x8026
  unsigned short  pad2;                      // 0x8028
  unsigned short  OUI;                       // 0x802a
  unsigned short  pad3;                      // 0x802c
  unsigned short  OUILSB;                    // 0x802e
  unsigned short  pad4;                      // 0x8030
  unsigned short  Version;                   // 0x8032
  unsigned short  pad5;                      // 0x8034
  unsigned short  BoardIdMSB;                // 0x8036
  unsigned short  pad6;                      // 0x8038
  unsigned short  BoardId;                   // 0x803a
  unsigned short  pad7;                      // 0x803c
  unsigned short  BoardIdLSB;                // 0x803e
  unsigned short  pad8[7];                   // 0x8040-0x804c
  unsigned short  Revision;                  // 0x804e
  unsigned short  pad9[0xb0/sizeof(uint16_t)];  // 0x8050 - 0x8100
  unsigned short  pad10[0xe00/sizeof(uint16_t)]; // 0x8100 - 0x8ffe
  unsigned short  pad11;                     // 0x8f00
  unsigned short  SerialMSB;                 // 0x8f02
  unsigned short  pad12;                     // 0x8f04
  unsigned short  SerialLSB;                 // 0x8f06
};


// Byte offset associated with a structure/field.


#define Offset(structname, field)  \
((unsigned int)&(((structname*)0x0)->field))

/// Short offset associated with a struct/field.

#define ShortOffset(structname, field) Offset(structname, field)/sizeof(uint16_t)
#define LongOffset(structname, field)  Offset(structname, field)/sizeof(uint32_t)

/// Read the buffer:
///
#define ReadBuffer   (((volatile Registers*)m_pModule)->Buffer[0])



/*!  Utility to read a block of data from the data buffer (FIFO).
     This is mainly here to optimize non mapped VME interfaces.
     \param pDest   - Pointer to the destination.
     \param nLongs  - Number of longs to read.
*/
void
CAENcard::ReadBufferBlock(uint32_t* pDest, Int_t nLongs)
{

  for(int i = 0; i < nLongs; i++) {
    int Datum = ReadBuffer;
    *pDest++ = swaplong(Datum);
  }

}


/*!
  Constructs a CAEN card.  The card can be addressed either
